#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
    // Регистрация тестов
    ЮТТесты
        .ДобавитьТестовыйНабор("Документы")
            .ДобавитьТест("ТестЗаписьКлиента")
КонецПроцедуры

#КонецОбласти

Функция ЗаписьКлиента() Экспорт
	Возврат Тест_ЗаписьКлиента;
КонецФункции

Функция ТестЗаписьКлиента() Экспорт
	документСсылка = ЗаписьКлиента().СоздатьДокмент();
	ЮТест.ОжидаетЧто(документСсылка).ИмеетТип("ДокументСсылка.ЗаписьКлиента").Заполнено();
КонецФункции